Revit 2027 API
ParameterTypeId.ColumnTopAttachedParam Property
 "Top is Attached"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnTopAttachedParam { get; }
Public Shared ReadOnly Property ColumnTopAttachedParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnTopAttachedParam {
	ForgeTypeId^ get ();
}
static member ColumnTopAttachedParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace